Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །སྦྱིན་སྲེག་ཆོ་གའི་རིམ་པ་འདི།
en: This is the procedure to follow when offering homa.

source: །ཞི་བ་རྒྱས་པ་དབང་དང་ནི།
en: In the rites of pacifying, enriching, or enthralling,

source: །ཁུ་བ་སྲིད་པའི་སྦྱིན་སྲེག་ལ།
en: The homa should consist of semen.

source: །བཤང་གཅི་ཁྲག་དང་རྐང་དང་ནི། །རུས་པ་ཤ་ཆེན་སྦྱིན་སྲེག་གི །ཐམས་ཅད་ལས་ནི་ཁ་བཀང་ཡིན།
en: “Through the homa consisting of feces, urine, blood, bone marrow, bones, and human flesh, all the recipients become filled with joy.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་རྡོ་རྗེ་ཡེ་ཤེས་ཀྱི་འཁོར་ལོ་སྒྲུབ་པའི་ཡེ་ཤེས་རྡོ་རྗེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་འཁོར་ལོ་ཐམས་ཅད་རབ་ཏུ་བསྒྲུབ་པའི་སྦྱོར་བའི་ལས་རྒྱས་པ་ཕྱི་དང་ནང་དུ་གྱུར་པ་འདི་བཀའ་སྩལ་པ།
en: Then the Blessed One, having entered the samādhi called “The Vajra That Accomplishes the Wisdom Circle of the Vajra-Tathāgata Great Vairocana,” taught the elaborate outer and inner ritual methods for accomplishing the complete wisdom circle:

source: གང་གི་གང་ཡང་ལྷའི་འཁོར་ལོའི་དབུས་སུ་བཅུག་པ་དེའི་མཚན་དུ་བསྟན་པར་འགྱུར་བའི་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ནི་མཁས་པས་བསྔགས་སོ།
en: “Whatever deity is brought inside the center of the circle, that circle is praised by the buddhas as the vajra maṇḍala that is to be indicated with the name of that deity.

source: །ཞི་བ་དང་། རྒྱས་པ་དང་། དབང་དང་། མངོན་སྤྱོད་ཀྱི་ལས་རྣམས་ལ་བདག་པོས་འཁོར་ལོའི་རྒྱལ་མོ་རྣམ་པར་བསྒོམ་པར་སྦྱོར་བར་བྱེད་དོ།
en: “He should perform the rites of pacifying, enriching, Enthralling, and assaulting with authority, Applying thereto the powers of wisdom

source: །བྷ་གའི་དབུས་སུ་ཟླ་བའི་དཀྱིལ་འཁོར་གང་བ་བསྒོམ་པར་བྱ་སྟེ།
en: Of the maṇḍala’s main deity. “He should visualize inside the bhaga The disk of a full moon, and on it,

source: ཏཱྃ་ལས་སྐྱེས་པའི་ལྷ་མོ་སྒྲོལ་མ་མཐུ་ཆེན་མོ་སྒེག་པའི་རོས་ཡང་དག་པར་གནས་མ།
en: Arising out of the imagined syllable tāṁ , The goddess Tārā, she who has great magical powers. “She is imbued with the sentiment of erotic love;

source: ཞལ་བརྒྱད་མ། སྤྱན་གསུམ་མ། ཕྱག་བཅུ་དྲུག་མ། ཞལ་འཛུམ་པ། མ་ར་ཀ་ཏ་ལྟ་བུ།
en: she has sixteen arms and seven faces, each one with three eyes, and is smiling.

source: ལང་ཚོ་ཕུན་སུམ་ཚོགས་མ།
en: She is emerald in color and replete with the freshness of youth.

source: ན་བཟའ་སྣ་ཚོགས་མན་པས་མ། དོ་ཤལ་དང་། རྐང་གདུབ་དང་། ལག་གདུབ་དང་། དཔུང་རྒྱན་དང་། རྣ་རྒྱན་དང་། སྐ་རགས་ཆེན་པོ་དང་། རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་མ།
en: She wears brightly colored clothes, a pearl necklace, anklets, a choker, a diadem, arm bracelets, earrings, a waist chain, and so forth. She is adorned with different kinds of jewelry;

source: ཨུཏྤ་ལ་ཡིས་སྤྱི་བོ་བརྒྱན་མ། ཡ་བའི་མེ་ཏོག་ལྟ་བུར་མཆོག་མ། གཡོན་བརྐྱང་བས་གནས་སུ་བཞུགས་མ། སུམ་ཅུ་རྩ་གསུམ་གྱི་བདག་པོ་ཡང་འཇིགས་ཤིང་སྐྲག་པར་མཛད་ཅིང་།
en: her hair is adorned with a blue lotus flower and her body hue resembles barley flowers. She stands with her left leg outstretched and her right slightly bent, inspiring fear even in the masters of the realms of the thirty-three who fold their hands in a gesture of reverence.

source: གཞན་ཡང་ཐལ་མོ་སྦྱོར་བ་དང་། འོད་ཟེར་དམར་པོ་ཉེ་བར་འབར་ཞིང་སངས་རྒྱས་ཀྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་སྤྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལམ་ལྟ་བུར་སྡུག་པར་རྣལ་འབྱོར་པས་བསྒོམ་པར་བྱས་ན་མྱུར་དུ་སངས་རྒྱས་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: She is ablaze with red flames and surrounded by buddhas radiating light all around. If the practitioner visualizes her, the dear mother of all sentient beings, as such, he will swiftly attain the state of awakening.

source: །དང་པོ་ན་རལ་གྲིའོ།
en: “In her first right hand she holds a sword;

source: །གཉིས་པ་ན་ཨུཏྤ་ལའོ།
en: in the second, a blue lotus;

source: །གསུམ་པ་ན་མདའོ།
en: in the third, an arrow;

source: །བཞི་པ་ན་རྡོ་རྗེའོ།
en: in the fourth, a vajra scepter;

source: །ལྔ་པ་ན་ལྕགས་ཀྱུའོ།
en: in the fifth, a goad;

source: །དྲུག་པ་ན་དབྱིག་པའོ།
en: in the sixth, a staff;

source: །བདུན་པ་ན་གྲི་གུག་གོ།
en: in the seventh, a flaying knife;

source: །བརྒྱད་པ་ན་མི་འཇིགས་པའོ།
en: and with the eighth she displays the mudrā of fearlessness.

source: །གཡོན་པའི་དང་པོ་ན་ཐོད་པའོ།
en: In her first left hand she holds a human skull cup;

source: །གཉིས་པ་ན་སྡིགས་མཛུབ་བོ།
en: with the second she displays the threatening mudrā;

source: །གསུམ་པ་ན་གཞུའོ།
en: in the third she holds a bow;

source: །བཞི་པ་ན་ཁ་ཊྭ་གའོ།
en: in the fourth, a khaṭvāṅga;

source: །ལྔ་པ་ན་ཞགས་པའོ།
en: in the fifth, a noose;

source: །དྲུག་པ་ན་མིའི་མགོ་བོའོ། །བདུན་པ་ན་རིན་པོ་ཆེའོ།
en: in the sixth, a trident; in the seventh, a jewel;

source: །བརྒྱད་པ་ན་བུམ་པ་འཛིན་པའོ།
en: and in the eighth, a pitcher.

source: །གཡས་པའི་ཞལ་དང་པོ་ནི་སྔོན་པོའོ། །གཉིས་པ་ནི་སེར་པོ་ཡང་དག་པར་འབར་བའོ།
en: “Her first face on the right side is blue, and the second one blazes with the color yellow.

source: །གཡོན་པའི་དང་པོ་ནི་དཀར་པོའོ། །གཉིས་པ་ནི་ལྗང་གུ་དང་། བཻཌཱུ་རྱ་ལྟ་བུའོ།
en: The first face on the left side is white, and the second has the greenish color of beryl.

source: །སྟེང་གི་ཞལ་ནི་རྣམ་པར་གཙིགས་ཤིང་། དུ་བའི་མདོག་དང་། འཇིགས་པ་ཆེན་པོ་དང་། ཁྲོ་གཉེར་ཤིན་ཏུ་འཇིགས་པར་བྱེད་པ།
en: Her upper face bares its fangs, and is smoky in color, frighteningly contorted, hideous, and terrifying.

source: དངོས་གྲུབ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་པ། དེ་ལྟར་ལྷ་མོ་བསྒོམ་པར་བྱའོ།
en: So should he visualize the goddess who bounteously bestows all accomplishments.

source: །དེ་ནས་སྟེང་གི་ཞལ་བོང་བུའི་རྣམ་པ་དང་། འདོད་པའི་གཟུགས་ཅན་མ། ཞབས་བཞི་པ། རྩེ་གསུམ་སྦྲུལ་གྱིས་བསྐོར་བ། དེ་བཞིན་དུ་ཧེ་རུ་ཀ་ཞེས་བྱ་བ་ངེས་པར་རྒྱུའི་མཆོག་བསྒོམ་པར་བྱའོ། །བྷ་གའི་ནང་དུ་ཡཾ་ལས་རླུང་གི་དཀྱིལ་འཁོར་དུ་བའི་རྣམ་པར་བསམ་པར་བྱའོ།
en: “Further above, he should visualize another face with the form of a donkey’s, or some other desired form. With her four feet, a trident, and snakes wrapped around, she is referred to as “Herukī,” and should be visualized as the ultimate cause of accomplishments. Inside the bhaga he should visualize, arising from the syllable yaṁ , the maṇḍala of wind, which has the appearance of smoke.

source: །དེའི་སྟེང་དུ་ཟླ་བའི་དབུས་སུ་དྷཱིཿཡོངས་སུ་གྱུར་པ་ལས་འཇམ་པའི་དབྱངས་ཀྱི་གཟུགས་སུ་བདག་ཉིད་བསམས་ནས་དེའི་སྙིང་གར་ཨ་ལས་ཉི་མའི་དཀྱིལ་འཁོར་བསམས་ཏེ།
en: Above it, in the center of a moon disk, he should visualize himself in the form of Mañjuśrī transformed from the syllable dhīḥ . In his heart he should visualize a sun disk transformed from the syllable āḥ

source: དེ་ནས་ཉི་མའི་དཀྱིལ་འཁོར་ལས་འོད་ཟེར་ཕྱུང་སྟེ་ཆོ་ག་བཞིན་དུ་མཆོད་པར་བྱའོ།
en: From this sun disk, he should radiate rays of light and make offerings with them as prescribed.

source: །དེའི་སྟེང་དུ་ཧཱུྃ་འོད་ཟེར་ལྔ་དང་ལྡན་པ་བསམས་ནས་དེ་ཡོངས་སུ་གྱུར་པ་ལས་རྡོ་རྗེ་འཇིགས་བྱེད་ཞལ་དགུ་པ་མ་ཧེའི་གཟུགས་དང་། ཞབས་བཅུ་དྲུག་པ།
en: Above the sun disk, he should visualize the syllable hūṁ made of five-colored light. This syllable is transformed into Vajrabhairava with nine faces and the form of a buffalo.

source: ཕྱག་སུམ་ཅུ་རྩ་བཞི་པ།
en: He has sixteen feet and thirty-four arms.

source: གཅེར་བུ་སྐུ་མདོག་ནག་ཅིང་གཟི་བརྗིད་ཆེན་པོ།
en: He is naked and black in color with great brilliance.

source: ཐོད་པ་མཆོག་གིས་བརྒྱན་པར་མཛད་ཅིང་།
en: The crown of his head is adorned with five skulls and he inspires great fear.

source: འཇིགས་བྱེད་ཆེན་པོའི་སྟེང་གི་ལིང་ག་དང་། གཡོན་བརྐྱང་བས་བཞུགས་ཤིང་།
en: He stands with his left leg outstretched and his right slightly bent, with his liṅga erect.

source: གསུས་པ་ཆེ་བ་དང་། སྐུ་ཆེ་ཞིང་སྐྲ་སྟེང་དུ་འབར་བས་འཇིགས་པའི་རྣམ་པ་དང་། ཐོད་པའི་ཕྲེང་བའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: He has a protruding belly, a huge body, and upward flowing hair resembling a blazing sun. He is adorned with a garland of skulls and other ornaments.

source: འཇིགས་པ་ཆེན་པོའི་དུས་ལྟ་བུར་སྒྲོགས་པ་དང་། སྐྱེས་པའི་པགས་པ་དང་། ཚིལ་དང་། ཁྲག་དང་། ཤ་དང་། །ལྟོ་བའི་ཚིལ་དང་། རྐང་ཟ་བ་དང་། ཚངས་པ་དང་བཅས་པ་དང་། ཉེ་དབང་དང་། དྲག་པོ་ལ་སོགས་པའི་འཇིག་རྟེན་གསུམ་ཟ་བ་དང་། སྒྲ་ཆེར་བཞད་ཅིང་ལྕེ་ནར་བ་དང་། འཇིགས་པ་ཡང་འཇིགས་པར་མཛད་པ་བསམ་པར་བྱའོ།
en: He makes a roaring sound like at the time of the final dissolution of the world. He should visualize him consuming human blood, fat, serum, flesh, lymph, and bone marrow, while devouring the triple universe along with Brahmā, Indra, Upendra, Rudra, and so forth. “With his loud laughter and lolling tongue he frightens even fear itself.

source: །དང་པོ་ནི་མ་ཧེའི་གདོང་ངོ་།
en: His first face is that of a buffalo.

source: །གཡས་པའི་རྭའི་ཞལ་གསུམ་ནི་སྔོན་པོ་དང་། དམར་པོ་དང་། སེར་པོ་སྟེ། །ཁྲོ་གཉེར་དང་། ཞལ་གཙིགས་པའོ།
en: On his right horn there are three faces—blue, red, and yellow—each contorted with anger.

source: །གཡོན་པ་ནི་དཀར་པོ་དང་། དུ་བ་དང་། ནག་པོའོ།
en: On the left horn, the three faces are white, smoky, and black.

source: །དེ་དག་གི་དབུས་སུ་ཞལ་ཤིན་ཏུ་དམར་བ་ཁྲག་འཛག་པའོ།
en: Between the two horns there is an intensely red face with blood streaming from its mouth.

source: །དེའི་སྟེང་དུ་འཇམ་པའི་གཟུགས་ཤིན་ཏུ་སེར་ཞིང་ཅུང་ཟད་ཁྲོ་བ་དང་། བྱིས་པའི་རྒྱན་དང་། གཙུག་པུད་ལྔའི་མཆོག་དང་གཞོན་ནུ་སྟེ།
en: Above it there is the princely youth Mañjuśrī, intensely yellow, semi-wrathful, wearing the ornaments of youth and a crown of five strips of cloth.

source: །དེ་ལྟར་བརྟན་པར་བྱས་ནས་ཤིན་ཏུ་མཉམ་པར་གཞག་པས་སྔགས་པས་བསྒོམ་པར་བྱའོ།
en: Having stabilized this visualization, the mantra adept should cultivate himself as the deity with a well-focused mind.

source: །དེ་ནས་གཡས་པའི་དང་པོ་ན་ནི་གྲི་གུག་གོ།
en: “Furthermore, in his first hand on the right, Vajrabhairava holds a flaying knife;

source: །གཉིས་པ་ན་ནི་འབིགས་བྱེད་སྐྱོང་བའོ།
en: in the second, a javelin;

source: །གསུམ་པ་ན་ནི་གཏུན་ཤིང་ངོ་།
en: in the third, a mace;

source: །བཞི་པ་ན་ནི་ཆུ་གྲིའོ།
en: in the fourth, a small knife;

source: །ལྔ་པ་ན་ནི་ཀ་ཎ་ཡའོ། དྲུག་པ་ན་ནི་སྟ་རེའོ།
en: in the fifth, a half-spear; in the sixth, an axe;

source: །བདུན་པ་ན་ནི་མདུང་ངོ་།
en: in the seventh, a spear;

source: །བརྒྱད་པ་ན་ནི་མདའོ།
en: in the eighth, an arrow;

source: །དགུ་པ་ན་ནི་ལྕགས་ཀྱུའོ།
en: in the ninth, a goad;

source: །བཅུ་པ་ན་ནི་དབྱིག་ཏོའོ།
en: in the tenth, a club;

source: །བཅུ་གཅིག་པ་ན་ནི་ཁ་ཊྭ་གའོ།
en: in the eleventh, a khaṭvāṅga;

source: །བཅུ་གཉིས་པ་ན་ནི་འཁོར་ལོའོ།
en: in the twelfth, a discus;

source: །བཅུ་གསུམ་པ་ན་ནི་རྡོ་རྗེའོ།
en: in the thirteenth, a vajra scepter;

source: །བཅུ་བཞི་པ་ན་ནི་རྡོ་རྗེ་ཐོ་བའོ།
en: in the fourteenth, a vajra hammer;

source: །བཅྭ་ལྔ་པ་ན་ནི་རལ་གྲིའོ།
en: in the fifteenth, a sword;

source: །བཅུ་དྲུག་པ་ན་ནི་ཅང་ཏེའུའོ།
en: and in the sixteenth, a ḍamaru.

source: །ཕྱག་གཡོན་པའི་དང་པོ་ན་ནི་ཐོད་པའོ།
en: “On the left side, in his first hand, he holds a skull cup;

source: །གཉིས་པ་ན་ནི་མགོ་བོའོ།
en: in the second, a human head;

source: །གསུམ་པ་ན་ནི་ཕུབ་བོ།
en: in the third, a shield;

source: །བཞི་པ་ན་ནི་རྐང་པའོ།
en: in the fourth, a foot;

source: །ལྔ་པ་ན་ནི་ཞགས་པའོ།
en: in the fifth, a noose;

source: །དྲུག་པ་ན་ནི་གཞུའོ།
en: in the sixth, a bow;

source: །བདུན་པ་ན་ནི་རྒྱུ་མའོ།
en: in the seventh, entrails;

source: །བརྒྱད་པ་ན་ནི་དྲིལ་བུའོ།
en: in the eighth, a bell;

source: །དགུ་པ་ན་ནི་ལག་པའོ།
en: in the ninth, a hand;

source: །བཅུ་པ་ན་ནི་དུར་ཁྲོད་ཀྱི་རས་སོ།
en: in the tenth, a rag from a charnel ground;

source: །བཅུ་གཅིག་པ་ན་གསལ་ཤིང་གིས་ཕུག་པའི་སྐྱེས་བུའོ།
en: in the eleventh, a man impaled on a stake;

source: །བཅུ་གཉིས་པ་ན་ནི་མེའི་ཐབ་ཁུང་ངོ་།
en: in the twelfth, a fire pit;

source: །བཅུ་གསུམ་པ་ན་ནི་ཐོད་པའོ། །བཅུ་བཞི་པ་ན་ནི་སྡིགས་མཛུབ་བོ།
en: and in the thirteenth, a goblet. With the fourteenth he displays the threatening mudrā;

source: །བཅྭ་ལྔ་པ་ན་ནི་བ་དན་ལྕེ་གསུམ་པའོ།
en: with the fifteenth, a hand gesture with three fingers stretched out;

source: །བཅུ་དྲུག་པ་ན་ནི་རླུང་གི་རས་སོ། །གཉིས་ཀྱིས་ནི་གླང་པོའི་པགས་པ་འཛིན་པའོ།
en: and in the sixteenth, he holds a ‘wind-cloth.’ With the remaining pair of hands he holds an elephant hide.

source: །ཞབས་གཡས་པའི་འོག་ཏུ་ནི་མི་དང་། །མ་ཧེ་དང་། གླང་དང་། །བོང་བུ་དང་། རྔ་མོ་དང་། ཁྱི་དང་། ལུག་དང་། ཅེ་སྦྱང་ངོ་།
en: “Under his right foot there are men, buffaloes, bulls, donkeys, camels, dogs, rams, and jackals.

source: །ཞབས་གཡོན་པའི་འོག་ཏུ་ནི་བྱ་རྒོད་དང་། འུག་པ་དང་། ཁྭ་དང་། ནེ་ཙོ་དང་། ཁྲ་དང་། མན་ཏྲི་དང་། བྱ་རྒོད་ཆེན་པོ་དང་། བྱ་ལོང་ངོ་། །དེ་ལྟར་གྱུར་པའི་རྡོ་རྗེ་འཇིགས་བྱེད་བསམ་གཏན་ནམ་འདྲིར་གཞུག་པར་བྱའོ།
en: Under his left foot there are vultures, owls, crows, parrots, hawks, cocks, eagles, and cranes. He should visualize Vajrabhairava as such.

source: །དེའི་འོག་ཏུ་དུར་ཁྲོད་ཆེན་པོ་སྲིན་པོ་དང་། ཞིང་སྐྱོང་བ་དང་། རོ་ལངས་དང་ལྡན་པ་དང་། གསལ་ཤིང་གིས་ཕུག་པའི་སྐྱེས་བུ་དང་། བསྲེགས་པའི་སྐྱེས་བུ་དང་། མདུང་གིས་ཕུག་པ་དང་། ཁྭ་དང་། བྱ་དུ་མ་དང་། ཁྱི་དང་ལྡན་པར་ཧ་ཧས་ཀུན་ཏུ་ཁྱབ་པར་བྱེད་པ་དེ་ལྟར་ཆོ་གས་རྣལ་འབྱོར་པས་བསྒོམ་པར་བྱའོ།
en: Optionally, he should commission a painting of him. “Below Vajrabhairava he should visualize a great cemetery overrun with rākṣasas, kṣetrapālas, and vetālas; filled with humans impaled on stakes, humans hanged from banyan trees, burning humans, humans pierced with spears, lots of crows and other birds, and dogs; and resounding with disquieting laughter, hā hā

source: །དྲག་ཤུལ་གྱི་ལས་ཐམས་ཅད་རབ་ཏུ་གྲུབ་པར་བྱེད་པ་ཞེས་བྱ་བ་རྡོ་རྗེ་འཇིགས་བྱེད་ཆེན་པོ་འདི་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ཏོ།
en: So should the practitioner visualize the Great Bhairava who makes all cruel rites successful.” So spoke the Blessed One.

source: །དེ་ནས་མཱྃ་ལས་ཡེ་ཤེས་སྐྱེས།
en: “Next, he should visualize arising from the syllable māṁ

source: །འོད་ཟེར་ཅན་ནི་སྣང་བྱེད་དོ།
en: The goddess Mārīcī, as bright as the sun,

source: །རྟ་བདུན་དག་གི་ཤིང་རྟར་གནས།
en: Riding on a chariot drawn by seven horses

source: །འབར་བའི་དཀྱིལ་འཁོར་འཇིགས་བྱེད་མ།
en: And radiant with a halo of flames around her.

source: །ཞལ་གསུམ་མ་ལ་སྤྱན་གསུམ་མ།
en: “Each of her three faces has three eyes.

source: །ཕྱག་དྲུག་མདོག་ནི་སེར་མོ་མཚུངས།
en: She is yellow and has six arms.

source: །གཡས་པ་སྔོན་པོར་གྱུར་པ་དང་། །གཡོན་པ་ཀུན་ད་ཟླ་བ་མཚུངས།
en: The face on the right is blue; The one on the left is the color of jasmine flowers or the moon.

source: །འོད་ཟེར་དུ་མའི་འོད་གསལ་མ།
en: “She is resplendent with the light of manifold rays.

source: །ཕྱོགས་བཅུ་སྲུང་བ་རྩོམ་པ་མོ།
en: She is engaged in guarding the ten directions.

source: །ཞལ་ནི་རྣམ་པར་འཛུམ་པ་དང་། །སྒེག་ཅིང་ཤིན་ཏུ་ལང་ཚོ་བབ།
en: Being in the throes of youth she is smiling, with all her faces Expressing the sentiment of erotic love.

source: །སྣ་ཚོགས་གོས་ལ་སོགས་པ་དང་། །རྒྱན་རྣམས་ཀུན་གྱིས་རྒྱན་བྱེད་མ།
en: “Her body is adorned with various garments And bedecked with all types of jewelry.

source: །དབུ་རྒྱན་རྫོགས་པའི་སངས་རྒྱས་ལྔ།
en: Her crown is set with the five buddhas

source: །ཐོར་ཚུགས་མེ་ཏོག་དག་གིས་སྤྲས།
en: And her matted hair adorned with flowers.

source: །གཡས་པའི་ཕྱག་ན་རྡོ་རྗེ་སྟེ།
en: “In her first right hand she carries a vajra scepter;

source: །གཉིས་པ་ཁབ་ནི་སྐུད་པ་ཅན།
en: In the second, a threaded needle;

source: །གསུམ་པར་མདའ་ནི་གསོར་བ་སྟེ།
en: And in the third, she holds up an arrow.

source: །གཡོན་པ་ལ་ནི་སྡིགས་མཛུབ་ཞགས།
en: With her first left hand she displays a threatening gesture and carries a noose;

source: །ཨ་ཤོ་ཀ་ཡི་ཡལ་ག་གཉིས།
en: “In the second, she carries an aśoka sprout;

source: །གསུམ་པ་ལ་ནི་གཞུ་ཉིད་དེ།
en: And in the third, a bow.

source: །ཀུན་དུ་འོད་ཟེར་སྣ་ཚོགས་ནི།
en: She is surrounded by multicolored light

source: །སངས་རྒྱས་སྤྲིན་དང་འདྲ་བ་སྤྲོ།
en: That radiates cloud-like masses of buddhas.

source: །སེམས་ཅན་རྣམས་ནི་དབང་དུ་སྡུད།
en: Are brought to the state of enthrallment.”

source: །བཅོམ་ལྡན་རྡོ་རྗེ་ཅན་གྱིས་གསུངས།
en: The tathāgata Vajrasattva.

source: །ཉི་མའི་དཀྱིལ་འཁོར་ངེས་བསམ་བྱ།
en: He should visualize a sun disk. On it, transformed from the syllable paṁ

source: །བྃ་ལས་ཡོངས་གྱུར་ལྷ་མོ་ནི། །ཁ་དོག་སེར་མོ་ཆེར་འབར་མ།
en: Is the goddess Parṇaśāvarī, yellow in color and with great splendor.

source: །ཞལ་གསུམ་མ་ལ་སྤྱན་གསུམ་ཉིད།
en: “Each of her three faces has three eyes,

source: །ཁྲོ་བཅས་ཞལ་ནི་འཛུམ་པ་དང་། །རྒྱན་རྣམས་ཀུན་གྱིས་ཤིན་ཏུ་བརྒྱན།
en: And the faces are smiling and angry at the same time. She is beautified by all manner of adornments;

source: །ཕྱག་དྲུག་སར་བའི་ལང་ཅོ་མ།
en: She has six arms and is endowed with the freshness of youth.

source: །གཡས་པའི་ཕྱག་ན་རྡོ་རྗེ་དང་། །གཉིས་བ་ན་ནི་དགྲ་སྟ་ཉིད།
en: “In her first right hand she holds a vajra scepter; in the second, an axe;

source: །གསུམ་པ་ན་ནི་མདའ་གསོར་མ།
en: and in the third, an arrow.

source: །གཡོན་པ་ན་ནི་སྡིག་མཛུབ་ཞགས།
en: “In her first left hand, formed into a threatening gesture, She holds a noose;

source: །གཉིས་པར་ཤིང་ལོའི་རྔ་ཡབ་དང་། །གསུམ་པར་གཞུ་ནི་འཛིན་པ་ཉིད།
en: In the second, a feather chowrie; and in the third, a bow.

source: །མེ་ཏོག་གིས་ནི་ཐོར་ཚུགས་དཀྲིས།
en: Her topknot is adorned with flowers.

source: །པདྨ་དཀར་པོ་གནས་པ་དང་། །འོད་ཟེར་དམར་པོས་བརྒྱན་པ་མ།
en: “She stands on a white lotus, Adorned by a red glow.

source: །ཁྲོ་བོ་འབར་བའི་སྤྲོ་བ་འབབ།
en: Engulfed in the flames of the fire of rage,

source: །ཁྲོ་བོ་འབར་བས་ཀུན་སྐྲག་ཅིང་།
en: She inspires fear with her burning rage.

source: །བསྲེགས་ཤིང་སྐྱེ་དགུ་གཟས་ཟིན་གང་།
en: “Any grahas that harm living beings are burned.

source: །ཁྲོ་བོ་འབར་བས་སྨོན་པ་དང་། །མི་བསྐྱོད་པ་ཡིས་མགོ་བོ་མནན།
en: “Ablaze with anger, she is unshakable, With Akṣobhya mounted on her head. She is nevertheless white when raining down

source: །དཀར་པོ་རིགས་ལྔའི་སངས་རྒྱས་ཡང་།
en: The five-colored nectar of the five buddhas.

source: །བདུད་རྩི་རབ་ཏུ་ཆར་འབེབས་པ། །སྔར་བཞིན་གཡས་དང་གཞན་པའི་ཞལ། །འདི་འདྲའི་སྒྱུ་མ་ཀུན་གཞིའི་ཕྱིར། །དེ་ལྟར་རྣལ་འབྱོར་པ་ཡིས་བསྒོམ། །ནད་ཐམས་ཅད་འཇོམས་པར་བྱེད་པའི་རི་ཁྲོད་མ་ཤིང་ལོ་ཅན་ཞེས་བྱ་བ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་ཆེན་པོས་བཀའ་སྩལ་ཏོ།
en: “Her right and left faces are as previously described. So should the practitioner meditate for the sake of pacifying all illusion that stems from misapprehension. Parṇaśāvarī truly is the remover of all illnesses.”

source: །རྡོ་རྗེ་ཁྲོ་བོ་བསྒོམ་པ་ནི།
en: So spoke the blessed tathāgata Great Vajra.

source: །ལྷ་མོ་སྐལ་བ་ཆེན་མོ་ཉོན།
en: “Listen, O goddess, O very fortunate one, About the meditation on Vajrakrodha!

source: །ཁྲོ་བོའི་སྐུར་ནི་བླངས་ནས་ནི།
en: Assuming his form,

source: །ཁྲོ་བོའི་རྒྱལ་པོ་བསྒོམ་པར་བྱ།
en: should visualize him, the lord of anger,

source: །ཞལ་བཞི་པ་ལ་ཕྱག་བཞི་པ།
en: “As having four arms and four faces,

source: །ཇི་སྲིད་དེ་བཞིན་ཕྱག་འབུམ་ཉིད།
en: Or up to 100,000 arms and faces.

source: །ཁྲོ་བོ་ཆེན་པོ་ལུས་དཀར་བ།
en: His body is white, he is fiercely angry, and he gazes at Vajravārāhī,

source: །དེ་མདོག་མཚོན་ཆ་འཛིན་མར་ནི། །རྡོ་རྗེ་ཕག་མོ་བརྟག་པར་བྱ།
en: Who is of the same color as him and holds her usual implements.

source: །དཔའ་བོ་ཐོད་པའི་ཕྲེང་བ་ཅན།
en: “He wears a garland of skulls;

source: །ཐལ་བས་ལུས་ལ་བྱུགས་པ་དང་། །ཕྱག་རྒྱ་ལྔ་ཡིས་རྣམ་པར་བརྒྱན།
en: His limbs are smeared with ashes. He is adorned with the five mudrās,

source: །མདུང་རྩེ་རལ་པའི་ཅོད་པན་མཚན།
en: And his hair, tied in a topknot, is marked with a spear-point.

source: །ཞལ་གྱི་མཆེ་བ་ཅུང་ཟད་གཙིགས།
en: “His face, with fangs showing slightly, is terrible.

source: །ཡི་དགས་ཆེན་པོ་གདན་མཛད་པ།
en: His seat is made of the great preta,

source: །པདྨ་ཆེན་པོ་འདབ་བརྒྱད་པ།
en: In the center of an eight-petaled lotus.

source: །ཁ་དོག་དམར་པོ་མཉམ་འོད་དུ།
en: He is red in color, with the same hue all over. “He is adorned with an image of a buddha on top of his head,

source: །རིག་མ་བཞི་དང་མཉམ་པར་ལྡན། །སངས་རྒྱས་གཟུགས་བརྙན་ཉེ་བར་མཛེས།
en: And accompanied by four wisdom goddesses.

source: །རྟ་ཡི་གཟུགས་སོགས་ཕྱག་བཞི་མ།
en: Each of the four has the form of a horse, and so forth,

source: །ཞལ་བཞི་དང་ནི་སྦྲུལ་གྱིས་བརྒྱན། །ཡི་གེ་ཡི་གེ་ཡང་དག་ལྡན།
en: Four arms, four faces, and is bedecked with adornments made of serpents. “He is furnished with individual syllables, one at a time,

source: །ཐོད་པར་བཞུགས་ཤིང་སྐུ་མདོག་དཀར།
en: Stands on a human skull, and is white in color.

source: །ཞལ་བཞི་ཡིས་ནི་རྣམ་པར་སྤྲས།
en: He is adorned with four faces,

source: །ཡར་ལ་ཝས་རྣམ་པར་བརྒྱན།
en: And ornamented with the syllables ya , ra , la , and va

source: །ཆོ་གས་ཇི་སྲིད་བསྒྲུབ་བྱ་བརྩམ།
en: “He should then commence the practice, to the extent possible, according to procedure.

source: །རླུང་སོགས་ཇི་ལྟར་རིམ་པས་ནི། །དུ་བ་དམར་དང་སེར་དང་དཀར།
en: Starting from the northwest and following the order of the quarters, he should in the colors of smoke, red, yellow, and white, respectively.

source: །བསམ་གཏན་འདིས་ནི་བལྟས་ཙམ་གྱིས། །འོ་མའི་ཤིང་ལྟར་བུད་མེད་རྣམས། །འཇུ་བར་འགྱུར་ཏེ་གཞན་དུ་མིན། །ར་ཡི་ཡི་གེ་ཡང་དག་ལྡན།
en: Merely by visualizing this in meditation, he can make a woman drip like an incised milk tree—it cannot be otherwise.

source: །ཁ་དོག་དམར་པོ་ཕྱག་བཞི་མ།
en: as red, With four arms, and marked with the syllable raṁ

source: །འབར་བའི་ཕྲེང་ཁྱབ་འཇིགས་མ་སྟེ།
en: He is surrounded by a halo of flames and terrifying;

source: །ཞལ་བཞི་ཝ་ཡི་གདོང་གིས་སྤྲས། །ཧཱུྃ་གིས་བཀང་བ་ཉིད་ཀྱིས་ནི།
en: He has four faces and is adorned with an face of a jackal.

source: །རྡོ་རྗེ་ཕྲ་མོ་རྣམ་བསྒོམས་པས།
en: “Visualizing tiny vajra scepters, Transformed from the syllable hūṁ

source: །སྣ་ཡི་རྩེ་མོར་རྫོགས་པ་ལས།
en: And emerging in great numbers from the tip of his nose,

source: །བསྒྲུབ་བྱའི་ལུས་ལ་དགང་བར་བྱ།
en: He should fill the target’s body with them. “With the target’s body bound

source: །ཡན་ལག་ཚིགས་ནི་ཐམས་ཅད་ལ། །སྣ་ཚོགས་རྡོ་རྗེ་ངེས་སྦྱར་བ།
en: At all its joints by the double vajra scepters,

source: །དེས་ནི་རྡོ་རྗེ་མཚོན་ཆ་ཡིས། །འབར་བ་དང་ནི་ཁྲག་གི་ལུས།
en: His body is set ablaze and gushes blood Through being struck with the vajra scepter. “He should visualize Vajraḍākinīs

source: །ཀུན་ཏུ་འཇིགས་པར་བྱེད་པར་ནི།
en: Sucking the target’s blood from every side.

source: །རྡོ་རྗེ་མཁའ་འགྲོ་མ་ནི་བསྒོམ།
en: “The mantra to recite is:

source: །ཨོྃ་བཛྲ་ཌཱ་ཀི་ནཱི་ཨ་མུ་ཀ་སྱ་རཀྟ་མཱ་ཀར་ཥ་ཡ་ཧཱུྃ་ཕཊ།
en: Oṁ , Vajraḍākinī! Please draw the blood of such and such! Hūṁ phaṭ ! “The ultimate way to draw blood

source: །ཁྲག་ནི་འགུགས་པར་བྱེད་པའི་མཆོག །ལྷ་མོ་དེ་ལྟར་བཤད་པས་ནི།
en: So it has been taught, O goddess!

source: །སྐེམས་པར་འདི་ལ་ཐེ་ཚོམ་མེད། །དེ་ནས་དེ་ཉིད་ཀུན་རྫོགས་ནས།
en: There is no doubt that the target will wither. “Now, he should visualize Vajrakrodha in the terrifying

source: །མ་ཧེའི་གཟུགས་ནི་འཇིགས་པ་མོ།
en: Form of a buffalo, arisen completely from the true essence.

source: །སྐུ་མདོག་ནག་པོ་འཇིགས་ཆེན་པོ།
en: He is black and horrible,

source: །ཞལ་བཞི་པ་དང་འཇིགས་པར་མཛད།
en: With four frightening faces.

source: །ཕྱག་བརྒྱད་པ་དང་ཞབས་བཞིས་སྤྲས།
en: “He has eight arms and four feet.

source: །རྡོ་རྗེ་གཏུན་ཤིང་རལ་གྲི་དང་། །འཁོར་ལོ་དེ་བཞིན་ཅང་ཏེའུ་ཉིད།
en: In his four right hands he is holding, respectively, a vajra hammer, a sword, a discus, and a ḍamaru.

source: །གཡོན་ན་ཁ་ཊྭཱྃ་ག་དང་ནི། །ཐོད་པ་གཞུ་དང་ཞགས་པ་ཉིད།
en: In the left ones he holds a khaṭvāṅga, a skull cup, a bow, and a noose. “He should then emanate Vajrakrodhas

source: །སྣ་ཚོགས་མཚོན་ཆ་འཛིན་པ་ཡི།
en: Armed with a variety of weapons.

source: །རྡོ་རྗེ་ཁྲོ་བོ་ཡང་ནི་སྤྲོ།
en: He should mentally remove

source: །ཡིད་ཀྱིས་བསྒྲུབ་བྱའི་སྲུང་བ་ནི།
en: The target’s protection according to procedure. “He should visualize the target

source: །ཆོ་ག་ཡིས་ནི་བཀུག་ནས་ནི། །དེས་ནི་བསྒྲུབ་བྱ་རྣམ་པར་བསམས།
en: Being bound by those Vajrakrodhas with fetters

source: །ཞགས་པས་བཅིངས་ནས་ལྷོ་ཕྱོགས་སུ། །རྡོ་རྗེ་ཁྲོ་བོས་དྲངས་ནས་ནི།
en: And dragged in the southern direction,

source: །རྡོ་རྗེ་གཞན་གྱིས་བརྡེག་པ་དང་། །རལ་གྲི་ཡིས་ནི་དྲལ་བ་དང་། །རྒྱུ་མ་ནར་ཞིང་མྱོས་པ་ཉིད།
en: While being struck by other Vajrakrodhas with vajra scepters “And cut open by them with swords, With feces flowing from his ripped entrails. “The mantra to repeat is: “ Oṁ , Vajrarākṣasa, devour him!

source: །ཨོྃ་བཛྲ་རཱཀྵ་ས་བྷ་ཀྵ་ཡེ་ཏི་ཕཊ།
en: phaṭ

source: །དེ་ནས་ཁྱི་ཡི་གདོང་བྱས་ནས།
en: “He should then meditate on Vajrarākṣasa, visualizing him with a dog’s face.

source: །རྡོ་རྗེ་སྲིན་པོ་བསྒོམ་པའོ།
en: “The following mantra is of Yama in his buffalo-faced form: “ Oṁ , hrīḥ ṣṭrīḥ ! You with contorted face!

source: །ཨོྃ་ཧྲཱིཿཥྚྲི་བི་ཀྲྀ་ཏཱ་ན་ན་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཕཊ་སྭཱ་ཧཱ།
en: Hūṁ hūṁ hūṁ phaṭ ! Svāhā

source: །འདི་ནི་མ་ཧེའི་གདོང་གཤིན་རྗེའི་གཟུགས་ཀྱི་སྔགས་སོ།
en: “He should visualize the target surrounded

source: །ཁྭ་དང་ཝ་དང་བྱ་རྒོད་ཀྱིས། །ཐམས་ཅད་དུ་ནི་ཡོངས་སུ་བསྐོར། །དེས་ནི་བཟའ་བ་ལྡན་པར་ནི།
en: On all sides by crows, jackals, and vultures;
